7zip
a52dec
aalib
abseil-cpp
accountsservice
acl
acpi
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
amd-ucode
aom
appstream
appstream-glib
aquamarine
archlinux-keyring
argon2
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
babl
base
base-devel
bash
bear
bind
binutils
bison
blas
blueman
bluez
bluez-libs
boost-libs
brave-bin
brightnessctl
brotli
btop
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cairomm-1.16
cantarell-fonts
cblas
cdparanoia
chafa
chromaprint
clang
clucene
cmake
compiler-rt
copyq
coreutils
cppdap
cronie
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
dkms
dmenu
dnssec-anchors
double-conversion
duktape
dunst
dvisvgm
e2fsprogs
efibootmgr
efivar
electron34
elfutils
ell
enchant
ethtool
exfat-utils
exiv2
exo
expat
eza
faac
faad2
fakeroot
fastfetch
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-kkc
fcitx5-mozc
fcitx5-qt
fd
ffcall
ffmpeg
ffmpegthumbnailer
fftw
file
filesystem
findutils
flac
flex
fluidsynth
fmt
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gamemode
gamescope
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gegl
gettext
ghostscript
giflib
gimp
girara
git
glfw
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmp
gnome-desktop
gnome-desktop-common
gnome-keyring
gnome-themes-extra
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
go
gobject-introspection-runtime
gparted
gperftools
gpgme
gpm
graphene
graphicsmagick
graphite
grep
grim
groff
grpc
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsl
gsm
gspell
gssdp
gst-plugin-va
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
gtkmm3
gtksourceview4
guile
gupnp
gupnp-igd
gvfs
gvfs-mtp
gzip
harfbuzz
harfbuzz-icu
hdparm
hicolor-icon-theme
hidapi
highway
htop
hunspell
hwdata
hyphen
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-qt-support
hyprland-qtutils
hyprlang
hyprlock
hyprpaper
hyprutils
hyprwayland-scanner
iana-etc
icu
ijs
imagemagick
imath
imlib2
inetutils
inkscape
intel-gmmlib
intel-media-driver
iproute2
iptables
iputils
iso-codes
iwd
jansson
jasper
java-runtime-common
jbig2dec
jbigkit
jemalloc
jq
jre-openjdk
json-c
json-glib
jsoncpp
kbd
kconfig5
kcoreaddons5
kdbusaddons
keyutils
kguiaddons
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kmod
knotifications5
krb5
kwidgetsaddons
kwindowsystem
kwindowsystem5
l-smash
lame
lapack
lcms2
leancrypto
lensfun
less
lib2geom
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnl
lib32-libnsl
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libunwind
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxcursor
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxkbcommon
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-vulkan-radeon
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libabw
libadwaita
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcups
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdnav
libdvdread
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libgcrypt
libgee
libgexiv2
libgirepository
libgit2
libglvnd
libgme
libgnomekbd
libgpg-error
libgtop
libgudev
libheif
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libixion
libjpeg-turbo
libjuice
libjxl
libkkc
libkkc-data
libksba
liblangtag
liblc3
libldac
libldap
libliftoff
liblqr
liblrdf
libltc
libluv
libmanette
libmaxminddb
libmd
libmicrodns
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmwaw
libmypaint
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpfm
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigc++-3.0
libsigsegv
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspiro
libspng
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libtraceevent
libunibreak
libunistring
libunwind
liburcu
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-intel-driver
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwmf
libwpd
libwpg
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lightdm
lightdm-gtk-greeter
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
linux-lts
linux-lts-headers
llhttp
llvm
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
luajit
lutris
lv2
ly
lz4
lzo
m4
mailcap
make
man-db
man-pages
marisa
mate-polkit
mbedtls
md4c
mdadm
mesa
mesa-utils
meson
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
mpv
mpv-mpris
msgpack-c
mtdev
mujs
mypaint-brushes1
nano
ncnn
ncurses
neon
neovim
nettle
network-manager-applet
networkmanager
ninja
nlohmann-json
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
notification-daemon
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
nwg-look
obs-studio
ocl-icd
oniguruma
openal
openbsd-netcat
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
opus
orc
os-prober
p11-kit
pacman
pacman-mirrorlist
pahole
pam
pambase
pamixer
pandoc-bin
pango
pangomm
pangomm-2.48
papirus-icon-theme
parted
paru
paru-debug
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perf
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
playerctl
polkit
poppler
poppler-data
poppler-glib
popt
portaudio
potrace
procps-ng
protobuf
psmisc
pugixml
python
python-appdirs
python-argcomplete
python-beautifulsoup4
python-cachecontrol
python-cairo
python-certifi
python-chardet
python-charset-normalizer
python-click
python-configobj
python-coverage
python-cssselect
python-dbus
python-distro
python-evdev
python-filelock
python-gobject
python-idna
python-linux-procfs
python-lockfile
python-lxml
python-moddb
python-msgpack
python-numpy
python-packaging
python-pillow
python-pipx
python-platformdirs
python-protobuf
python-psutil
python-pyserial
python-pyudev
python-requests
python-six
python-soupsieve
python-tqdm
python-urllib3
python-userpath
python-yaml
python-zstandard
qbittorrent
qpwgraph
qrencode
qt5-base
qt5-declarative
qt5-multimedia
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt5ct
qt6-base
qt6-declarative
qt6-svg
qt6-translations
qt6-wayland
qt6ct
radeontop
ragel
raptor
rasqal
rav1e
re2
readline
redland
rhash
ripgrep
ristretto
rnnoise
rofi-wayland
rsync
rtkit
rtmpdump
rubberband
run-parts
rustup
sbc
scour
sdbus-cpp
sdl2-compat
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
simdjson
slang
slurp
smartmontools
snappy
sndio
socat
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
steam
sudo
suitesparse
svt-av1
svt-hevc
swww
systemd
systemd-libs
systemd-sysvcompat
taglib
tar
tdb
texinfo
texlive-basic
texlive-bibtexextra
texlive-bin
texlive-binextra
texlive-context
texlive-fontsextra
texlive-fontsrecommended
texlive-fontutils
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-metapost
texlive-music
texlive-pictures
texlive-plaingeneric
texlive-pstricks
texlive-publishers
texlive-xetex
thunar
timeshift
tinysparql
tmux
tomlplusplus
tpm2-tss
traceroute
trash-cli
tree
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
tumbler
tuned
twolame
tzdata
uchardet
udisks2
ufw
unibilium
unrar
unzip
upower
usbutils
uthash
util-linux
util-linux-libs
v4l-utils
v4l2loopback-dkms
v4l2loopback-utils
vapoursynth
vesktop-bin
vid.stab
vkd3d
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
vulkan-intel
vulkan-radeon
vulkan-tools
waifu2x-ncnn-vulkan
wavpack
waybar
wayland
wayland-protocols
webkit2gtk-4.1
webp-pixbuf-loader
webrtc-audio-processing-1
wget
which
wildmidi
wine
wine-gecko
wine-mono
winetricks
wireless_tools
wireplumber
wl-clipboard
woff2
wpa_supplicant
wtype
x264
x265
xapp
xarchiver
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcur2png
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xf86-video-vmware
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xhost
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yt-dlp
yyjson
zathura
zathura-pdf-poppler
zbar
zenity
zeromq
zimg
zip
zix
zlib
zoxide
zram-generator
zsh
zstd
zvbi
zxing-cpp
zziplib
